package study.blaife.basic.doublecolon;

/**
 * 关于双冒号（::），方法引用的学习
 *
 * @Author: magd39318
 * @Date: 2021/7/27 16:04
 **/
public class MethodReferenceStudy {

    /*-----------------------------------------------------------------------*/
    /*      方法引用是和lambda表达式相关的一个重要特性，它提供了一种不执行方法的方法    */
    /*-----------------------------------------------------------------------*/

    /*-----------------------------------------------------------------------*/
    /*                   java8 方法引用的模型                                  */
    /*         1.静态方法引用： className::methodName                          */
    /*         2.对象的实例方法引用： instanceName::methodName                  */
    /*         3.对象的超类方法引用： super::methodName                         */
    /*         4.类构造器引用： className::new                                 */
    /*         5.数组构造器引用： typename[]::new                               */
    /*-----------------------------------------------------------------------*/

    public MethodReferenceStudy() {
    }
}
